{
    "post": {
        "title": "So I started a blog...",
        "date": "September 17 2020",
        "author": {
            "name": "Rodrigo Luger",
            "url": "../about.html",
            "image": "../images/avatar.jpg",
            "about": "I'm a Flatiron Fellow at the CCA in New York City, working on a variety of things related to exoplanets, stars, and astronomical data analysis. I'm interested in systematics de-trending, the search for and characterization of potentially habitable exoplanets, and the mapping of stellar and exoplanetary surfaces from photometric and spectroscopic datasets. Outside the office I love to hike, bike, swim, craft lattes, faulty parallelism, and oxford commas."
        },
        "banner": "images/first-post.jpg",
        "summary": "Ever since I started my postdoc at the <a href='https://www.simonsfoundation.org/flatiron/center-for-computational-astrophysics/'>CCA</a>, it feels like I've started a million different projects (and finished none). I have a lot of half-finished (or more like half-baked) ideas that I felt I had to write down somewhere, so I decided to start a blog! This blog will be a mishmash of posts on astronomy, data science, math, and any other random thoughts that pop into my head.",
        "contents": [
            "My main scientific interest right now is the mapping problem: trying to figure out what a (celestial) object looks like based only on its unresolved light curve (i.e., the changing flux we observe over time as the object spins on its axis). Astronomers have been studying the light curves of stars and solar system objects for <a href='http://articles.adsabs.harvard.edu/pdf/1906ApJ....24....1R'>over a century</a>, trying to figure out the shapes and albedo distributions of asteroids and the spot properties of magnetically active stars. More recently, this same technique has been applied to exoplanets: we can study their changing phase curves as they orbit their host star to infer temperature differences across their surfaces, which can tell us a whole host of information about their surface morphology, their atmospheres, and even (some day) their habitability. In the age of big data, where thanks to missions like Kepler and TESS we now have access to hundreds of thousands of stellar light curves, one might expect that astronomers have already figured out everything there is to know about stellar and planetary surfaces from their light curves. But, unfortunately, that is far from being true. The reason is mathematical in nature: the mapping problem is extremely ill-conditioned.",
            [
                "images/hd189733b.jpg",
                "A light curve of HD 189733 (left) and the inferred surface map of its hot Jupiter companion, HD 189733b (right), from <a href='https://ui.adsabs.harvard.edu/abs/2007Natur.447..183K/abstract'>Knutson et al. (2007)</a>. At phase 0 the planet transits the star, while at phase 0.5 the planet is occulted by the star, causing dips in the light curve. The curvature of the light curve is due to the phase curve of the planet. Near the transiting configuration, we see the planet's cold night side (flux minimum) and near the occulting configuration, we see the planet's hot day side (flux maximum). The fact that the flux maximum occurs slightly <span style='font-style: italic;'>before</span> occultation implies the hottest point on the surface of the planet is slightly shifted away from stellar noon, as shown in the inferred brightness map at the right."
            ],
            "While in some cases it is possible to infer a (low resolution) map of the star or planet (as in the figure above), in most cases there exists no unique solution. The projection from a two-dimensional space (the stellar or planetary surface) to a one-dimensional curve (the light curve) is <span style='font-style: italic;'>many-to-one</span>, meaning there are many maps that result in the same light curve. The information lost in this projection has nothing to do with the quality of the data or the duration of the observation: it's a fundamental issue with the mapping technique. And by \"many maps\" I actually mean an <span style='font-style: italic;'>infinite number of maps</span>. The problem is so degenerate, in fact, that if you're interested in surface features on scales of (say) tens of degrees (such as star spots or continents), the light curve contains only on the order of ten percent of the surface brightness information. Ninety percent of it is lost in the projection! This gets progressively worse as we go to smaller scales, making it almost impossible to construct useful maps of stars and planets from their light curves.",
            "<span style='font-style: italic;'>Almost</span>.",
            "With clever statistical tricks, lots of data, and some fancy math, it is possible to squeeze more information out of these light curves to infer the things we actually care about: star spot properties, exoplanet atmosphere properties, and (eventually) surface properties of temperate terrestrial exoplanets. I plan to write a lot more about how to do this in future posts, so if you're interested, stay tuned!"
        ]
    }
}