{
    "post": {
        "title": "Reproducible scientific articles",
        "title_tiny": "Reproducible science",
        "date": "December 3 2021",
        "publish": true,
        "author": {
            "name": "Rodrigo Luger",
            "url": "../about.html",
            "image": "../images/rodrigo-luger-avatar.jpg",
            "about": "I'm a Flatiron Fellow at the CCA in New York City, working on a variety of things related to exoplanets, stars, and astronomical data analysis. I'm interested in systematics de-trending, the search for and characterization of potentially habitable exoplanets, and the mapping of stellar and exoplanetary surfaces from photometric and spectroscopic datasets. Outside the office I love to hike, bike, swim, craft lattes, faulty parallelism, and Oxford commas."
        },
        "banner": "images/showyourwork.jpg",
        "social_image": "images/rodrigo-luger-avatar.jpg",
        "summary": "In this post I'll talk a bit about <code>showyourwork!</code>, the open source scientific article workflow I've been working on for the past few months. It's still very much a work in progress, but you can already use it in your own research to ensure the reproducibility of your results! If you're interested, please check out <a href='https://github.com/rodluger/showyourwork'>the GitHub repository</a> and <a href='https://showyourwork.readthedocs.io'>the documentation</a>.",
        "contents": [
            {
                "src": "https://raw.githubusercontent.com/rodluger/showyourwork/img/banner.png",
                "caption": "Articles that use <code>showyourwork!</code> are automatically built on GitHub Actions CI to ensure the constant reproducibility of the results.",
                "css_classes": [
                    "small"
                ]
            },
            "<code>showyourwork!</code> is a workflow that enables the creation and distribution of fully reproducible and open source scientific articles. As astronomical software becomes increasingly more complex, and as research results become increasingly more interdependent, it is crucial to ensure the validity and correctness of papers published in the field. However, the current peer review system is simply not set up to do this, since checking all of the results in a paper would require the painstaking and methodical review of all of the paper’s methods—which usually means scrutinizing all of the code used to generate the figures, tables, and other quantities in the paper. In practice, this is virtually impossible for three reasons:",  
            "<span style='font-weight:bold;'>1.</span> Modern codebases can be very large and often require deep familiarity with the software to use—not to mention review them.", 
            "<span style='font-weight:bold;'>2.</span> Writing a paper in astronomy is rarely ever done in a linear, procedural fashion: the codebase is constantly changing, and the state of the code when (say) Figure 1 was produced may be very different from that when (say) Figure 2 was made. Moreover, many results depend on the execution of lengthy pipelines with intermediate steps, each potentially requiring manual tinkering that is not always documented and may be difficult to exactly replicate.",
            "<span style='font-weight:bold;'>3.</span> The majority of astronomical code is not open source and simply cannot be vetted by third parties. While there has been a marked increase in the number of open source astronomical <i>tools</i> in recent years (e.g., <a href='https://www.astropy.org/'>astropy</a>, <a href='https://docs.exoplanet.codes/en/latest/'>exoplanet</a>, <a href='https://github.com/dfm/emcee'>emcee</a>, <a href='https://exoplanetarchive.ipac.caltech.edu/docs/exofast/exofast_home.html'>exofast</a>...), most code associated with the generation of the results in individual papers is not open source; readers are often expected to take it on faith that there are no bugs in that code, or that the code works exactly as described in the text, with no pitfalls or missing details. Even when the code is made publicly available, e.g., by being published on GitHub, it is often not documented sufficiently to enable one to execute it and reproduce the paper’s results out-of-the-box. And even with proper documentation, the code may require external dependencies, custom virtual environments, or access to closed-source datasets that make it difficult or impossible for a third party to replicate it.",
            "<code>showyourwork!</code> was designed to tackle these three issues, making it easy to develop, publish, and distribute truly open and reproducible research papers in astronomy. It exists as a GitHub template repository, which <a href='https://github.com/rodluger/showyourwork-template/generate'>can be cloned at the click of a button</a> to set up a new article. Users then add their LaTeX manuscript, bibliography, scripts used in the generation of the paper’s figures, an anaconda environment specification, and instructions on how to download any external datasets required by the figures. Every time the user pushes a new commit to GitHub, the article is automatically built on the cloud using GitHub Actions and the resulting PDF is pushed to a separate branch of the repository. The build step—which sets up the conda environment, generates all figures from scratch (with intelligent caching), and compiles the PDF—acts as a unit test for the paper. If it passes, the paper is (by definition) reproducible.",
            {
                "src": "https://raw.githubusercontent.com/rodluger/showyourwork/img/workflow.png",
                "caption": "The <code>showyourwork!</code> philosophy: scientific papers should exist as GitHub repositories comprised of LaTeX files, figure scripts, rules to access datasets, a platform/environment specification, and nothing else. Anyone should be able to re-generate the article PDF from scratch at the click of a button.",
                "css_classes": [
                    "small"
                ]
            },
            "The workflow works out of the box for simple projects, in which each figure is generated by running a given Python script. But it also works for more complicated pipelines, such as projects that depend on many intermediate steps or those that require running expensive simulations on clusters. <code>showyourwork!</code> interfaces directly with Zenodo, allowing users to automatically upload the results of simulations so that expensive build steps can be bypassed on the cloud. In fact, most of the stuff under the hood in <code>showyourwork!</code> is there to make the workflow as flexible and customizable as possible; see the documentation for a list of examples of custom workflows.",
            "Papers that use <code>showyourwork!</code> can be reproduced by cloning the repository and running <code>make</code>. Furthermore, these papers include clickable icons next to each of their figures linking to (1) the exact version of the script used to generate them and (2) the exact version(s) of the Zenodo-hosted dataset(s) used in their creation.",
            "If you are interested in <code>showyourwork!</code>, please visit <a href='https://github.com/rodluger/showyourwork'>the GitHub repository</a> as well as <a href='https://showyourwork.readthedocs.io'>the documentation</a>. Specifically, check out <ul><li><a href='https://showyourwork.readthedocs.io/en/stable/quickstart/'>the quickstart tutorial</a></li><li><a href='https://showyourwork.readthedocs.io/en/stable/layout/'>the repository layout guide</a></li><li><a href='https://showyourwork.readthedocs.io/en/stable/faqs/'>the FAQs page</a></li><li><a href='https://showyourwork.readthedocs.io/en/stable/custom/'>the examples and custom workflows</a></li></ul>You can also find an up-to-date <a href='https://showyourwork.readthedocs.io/en/stable/projects/'>list of open-source projects that use showyourwork here</a>.",
            "<code>showyourwork!</code> is a work-in-progress. I am still actively developing it and working with several users, in astronomy and in other fields to make it flexible enough to accommodate various kinds of workflows. I released <code>showyourwork!</code> in mid-October 2021 and there are already four papers on the arXiv that were generated using it, with several others in prep. If you would like to contribute to the development or have any suggestions or feedback about <code>showyourwork!</code>, please contact me, post a comment in the discussion below, <a href='https://github.com/rodluger/showyourwork/issues/new'>raise an issue</a>, or open a pull request!"
        ]
    }
}